### Terraform Plan Output for `stage-team-account/state/dynamodb`
```hcl
[command]/home/runner/work/_temp/48af4034-bc69-4d45-8458-85db80edf678/terraform-bin show -no-color tfplan.binary

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.resource_locks["alb"] will be created
  + resource "aws_dynamodb_table" "resource_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "alb-stage-lock"
      + read_capacity    = (known after apply)
      + region           = "ap-northeast-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "stage"
          + "Name"        = "alb Lock Table"
        }
      + tags_all         = {
          + "Environment" = "stage"
          + "Name"        = "alb Lock Table"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table.resource_locks["dynamodb"] will be created
  + resource "aws_dynamodb_table" "resource_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "dynamodb-stage-lock"
      + read_capacity    = (known after apply)
      + region           = "ap-northeast-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "stage"
          + "Name"        = "dynamodb Lock Table"
        }
      + tags_all         = {
          + "Environment" = "stage"
          + "Name"        = "dynamodb Lock Table"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table.resource_locks["ec2"] will be created
  + resource "aws_dynamodb_table" "resource_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "ec2-stage-lock"
      + read_capacity    = (known after apply)
      + region           = "ap-northeast-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "stage"
          + "Name"        = "ec2 Lock Table"
        }
      + tags_all         = {
          + "Environment" = "stage"
          + "Name"        = "ec2 Lock Table"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table.resource_locks["ecr"] will be created
  + resource "aws_dynamodb_table" "resource_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "ecr-stage-lock"
      + read_capacity    = (known after apply)
      + region           = "ap-northeast-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "stage"
          + "Name"        = "ecr Lock Table"
        }
      + tags_all         = {
          + "Environment" = "stage"
          + "Name"        = "ecr Lock Table"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table.resource_locks["ecs"] will be created
  + resource "aws_dynamodb_table" "resource_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "ecs-stage-lock"
      + read_capacity    = (known after apply)
      + region           = "ap-northeast-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "stage"
          + "Name"        = "ecs Lock Table"
        }
      + tags_all         = {
          + "Environment" = "stage"
          + "Name"        = "ecs Lock Table"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table.resource_locks["eventbridge"] will be created
  + resource "aws_dynamodb_table" "resource_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "eventbridge-stage-lock"
      + read_capacity    = (known after apply)
      + region           = "ap-northeast-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "stage"
          + "Name"        = "eventbridge Lock Table"
        }
      + tags_all         = {
          + "Environment" = "stage"
          + "Name"        = "eventbridge Lock Table"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table.resource_locks["lambda"] will be created
  + resource "aws_dynamodb_table" "resource_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "lambda-stage-lock"
      + read_capacity    = (known after apply)
      + region           = "ap-northeast-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "stage"
          + "Name"        = "lambda Lock Table"
        }
      + tags_all         = {
          + "Environment" = "stage"
          + "Name"        = "lambda Lock Table"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table.resource_locks["s3"] will be created
  + resource "aws_dynamodb_table" "resource_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "s3-stage-lock"
      + read_capacity    = (known after apply)
      + region           = "ap-northeast-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "stage"
          + "Name"        = "s3 Lock Table"
        }
      + tags_all         = {
          + "Environment" = "stage"
          + "Name"        = "s3 Lock Table"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table.resource_locks["waf"] will be created
  + resource "aws_dynamodb_table" "resource_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "waf-stage-lock"
      + read_capacity    = (known after apply)
      + region           = "ap-northeast-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "stage"
          + "Name"        = "waf Lock Table"
        }
      + tags_all         = {
          + "Environment" = "stage"
          + "Name"        = "waf Lock Table"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_dynamodb_table.resource_locks["alb"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "alb-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "alb Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "alb Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["dynamodb"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "dynamodb-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "dynamodb Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "dynamodb Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["ec2"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "ec2-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "ec2 Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "ec2 Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["ecr"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "ecr-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "ecr Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "ecr Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["ecs"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "ecs-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "ecs Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "ecs Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["eventbridge"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "eventbridge-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "eventbridge Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "eventbridge Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["lambda"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "lambda-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "lambda Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "lambda Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["s3"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "s3-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "s3 Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "s3 Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["waf"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "waf-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "waf Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "waf Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0APlan: 9 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_dynamodb_table.resource_locks["alb"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "alb-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "alb Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "alb Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["dynamodb"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "dynamodb-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "dynamodb Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "dynamodb Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["ec2"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "ec2-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "ec2 Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "ec2 Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["ecr"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "ecr-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "ecr Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "ecr Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["ecs"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "ecs-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "ecs Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "ecs Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["eventbridge"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "eventbridge-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "eventbridge Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "eventbridge Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["lambda"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "lambda-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "lambda Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "lambda Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["s3"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "s3-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "s3 Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "s3 Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["waf"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "waf-stage-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "stage"%0A          + "Name"        = "waf Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "stage"%0A          + "Name"        = "waf Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0APlan: 9 to add, 0 to change, 0 to destroy.%0A

::set-output name=stderr::

::set-output name=exitcode::0
```